Documents/ВозвратТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ВозвратТМЦ</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТМЦ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.СальдоПоТаре</xr:Item>
				<xr:Item>AccumulationRegister.Сальдо</xr:Item>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>AccumulationRegister.Возвраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипВозврата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВозврата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомашина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Накладная</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНаценкой</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНаценкой</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Тары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БУ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/СальдоПоТаре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>СальдоПоТаре</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыВозврата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыВозврата</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВозвратТМЦ/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Предопределенные
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НазнчаитьТипСвязанныхСТипомВозвратаРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если Вопрос("Хотите обновить список возвратов?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ТарыЗаполнитьНаСервере(Истина)
	КонецЕсли;
КонецПроцедуры

// Товары
&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	//ТекСтрока.Цена = Ставки.Сложить(Справочники.Товары.Цена(ТекСтрока.Товар, "ЦенаБазовая", Дата), ТекСтрока.Товар.СтавкаНДС);
	ТоварыПересчитатьСтроку(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТоварыПересчитатьСтроку(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТоварыПересчитатьСтроку(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПересчитатьСтроку(ТекСтрока)
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
КонецПроцедуры

// Тары
&НаСервере
Процедура ТарыЗаполнитьНаСервере(Очистить = Ложь)
	Если Очистить Тогда
		Объект.Тары.Очистить();
	КонецЕсли;
	
    Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СальдоПоТаре.Товар КАК Тара,
		|	СУММА(СальдоПоТаре.КоличествоОстаток) КАК Количество
		|ИЗ
		|	РегистрНакопления.СальдоПоТаре.Остатки(&Дата, Контрагент = &Контрагент) КАК СальдоПоТаре
		|ГДЕ
		|	ИСТИНА
		|СГРУППИРОВАТЬ ПО
		|	СальдоПоТаре.Товар
		|УПОРЯДОЧИТЬ ПО
		|	СальдоПоТаре.Товар.Наименование"
	);

	Запрос.УстановитьПараметр("Дата", ОбщийМодульСервер.ПолучитьМоментВремениДокумента(Объект));
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаТара = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока ВыборкаТара.Следующий() Цикл
		СтарыеСтроки = Объект.Тары.НайтиСтроки(Новый Структура("Товар", ВыборкаТара.Тара));
		Если СтарыеСтроки.Количество() > 0 Тогда
			ТекСтрока = СтарыеСтроки[0];
		Иначе
			ТекСтрока = Объект.Тары.Добавить();
		КонецЕсли;
		ТекСтрока.Товар = ВыборкаТара.Тара;
		ТекСтрока.Сальдо = ВыборкаТара.Количество;
	КонецЦикла;
	
	Объект.Тары.Сортировать("Товар");
КонецПроцедуры

&НаКлиенте
Процедура ТарыЗаполнить(Кнопка)
	ТарыЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТарыОбновитьНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Сальдо.Товар КАК Тара,
	|	СУММА(Сальдо.КоличествоОстаток) КАК Количество
	|ИЗ
	|	РегистрНакопления.СальдоПоТаре.Остатки(&Дата, Контрагент = &Контрагент) КАК Сальдо
	|ГДЕ
	|	ИСТИНА");
	
	МассивТары = Новый Массив();
	Для Каждого ТекСтрока Из Объект.Тары Цикл
		МассивТары.Добавить(ТекСтрока.Товар);
	КонецЦикла;
	Запрос.Текст = Запрос.Текст + " И Сальдо.Товар В (&МассивТары)";
	Запрос.УстановитьПараметр("МассивТары", МассивТары);
	
	Запрос.Текст = Запрос.Текст + "
	|СГРУППИРОВАТЬ ПО
	|	Сальдо.Товар
	|УПОРЯДОЧИТЬ ПО
	|	Сальдо.Товар.Наименование";

	Запрос.УстановитьПараметр("Дата", Объект.Дата - 1);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаТара = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока ВыборкаТара.Следующий() Цикл
		СтарыеСтроки = Объект.Тары.НайтиСтроки(Новый Структура("Товар", ВыборкаТара.Тара));
		Если СтарыеСтроки.Количество() > 0 Тогда
			ТекСтрока = СтарыеСтроки[0];
		Иначе
			ТекСтрока = Объект.Тары.Добавить();
		КонецЕсли;
		
		ТекСтрока.Товар = ВыборкаТара.Тара;
		ТекСтрока.Сальдо = ВыборкаТара.Количество;
	КонецЦикла;
	
	Объект.Тары.Сортировать("Товар");
КонецПроцедуры

&НаКлиенте
Процедура ТарыОбновить(Кнопка)
	ТарыОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТарыУдалитьПС(Кнопка)
	ПустыеСтроки = Объект.Тары.НайтиСтроки(Новый Структура("Количество", 0)); 
	Для Каждого Строка Из ПустыеСтроки Цикл 
		Объект.Тары.Удалить(Строка); 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТарыТТН(Кнопка)
	ФактурыКлиент.СформироватьТТНПоТаре(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТарыАктПП(Кнопка)
	ФактурыКлиент.СформироватьАктПППоТаре(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТарыФактура(Кнопка)
	ФактурыКлиент.СформироватьСчетФактуру(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТарыТоварПриИзменении(Элемент)
	ТекСтрока = Элементы.Тары.ТекущиеДанные;
	//ТекСтрока.Цена = Ставки.Сложить(Справочники.Товары.Цена(ТекСтрока.Товар, "ЦенаБазовая", Дата), ТекСтрока.Товар.СтавкаНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТарыКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Тары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТарыЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.Тары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТарыПослеУдаления(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТарыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
КонецПроцедуры

// Итоги
&НаКлиенте
Процедура ОбновитьИтоги()
	КоличествоТовара = Объект.Товары.Итог("Количество");
	СуммаТовара = Объект.Товары.Итог("Сумма");
	
	КоличествоТары = Объект.Тары.Итог("Количество");
	СуммаТары = Объект.Тары.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТипВозвратаПриИзменении(Элемент)
	НазнчаитьТипСвязанныхСТипомВозвратаРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура НазнчаитьТипСвязанныхСТипомВозвратаРеквизитов()
	МассивТипов = Новый Массив();
	
	Если Объект.ТипВозврата = ПредопределенноеЗначение("Перечисление.ТипыВозврата.Приход") Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
		МассивТипов.Добавить(Тип("СправочникСсылка.ТранспортныеСредства"));
	Иначе
		МассивТипов.Добавить(Тип("Строка"));
	КонецЕсли;

	Элементы.Водитель.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	Элементы.Автомашина.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
КонецПроцедуры
